Revit 2027 API
STLExportOptions.SetTessellationSettings Method
 Sets all the tessellation parameters to its predefined values for the given resolution type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTessellationSettings(
	ExportResolution resolutionType
)
Public Sub SetTessellationSettings (
	resolutionType As ExportResolution
)
public:
void SetTessellationSettings(
	ExportResolution resolutionType
)
member SetTessellationSettings :
        resolutionType : ExportResolution -> unit
Parameters
resolutionType ExportResolution
 Type of exporting resolution.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
STLExportOptions Class
Autodesk.Revit.DB Namespace